[
    {
        "title": "Introduction to Afro-American History",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (HIS), AAF 150. Survey of Afro-American history from African origins to the current racial confrontation. (Lec. 3/Recitation) (A3) (C3)"
    },
    {
        "title": "Honors Section of HIS/AAF 150: Intro Afro-American History",
        "credits": "3",
        "description": "(3 crs.) Honors Section of HIS/AAF 150: Introduction to Afro-American History.  Cross-listed as (HIS), AAF 150. Survey of Afro-American history from African origins to the current racial confrontation. (Lec. 3) Pre: 3.40 overall GPA or better.  (A3) (C3)"
    },
    {
        "title": "Introduction to African-American Studies",
        "credits": "3",
        "description": "(3 crs.) Interdisciplinary exploration of some of the pivotal themes and issues in the study of peoples of African descent. (Lec. 3) (A3) (C3)"
    },
    {
        "title": "Introduction to Afro-American Culture",
        "credits": "3",
        "description": "(3 crs.)  Interdisciplinary survey of the social origins of Afro-American culture.  (Lec. 3/Online)"
    },
    {
        "title": "Free Women of Color in the Atlantic World",
        "credits": "3",
        "description": "(3 crs.) Free African descended women’s experiences living in societies with slaves and slave societies of the Atlantic World. (Lec. 3) Pre: AAF 150, or sophomore standing, or by permission of the instructor."
    },
    {
        "title": "History of Hip-Hop in Black American Culture",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (MUS), AAF 208. Explores hip-hop culture, surveying its historical development, political significance, social influence, and technological innovations. (Lec. 3) (A4) (C1)"
    },
    {
        "title": "Black Lives Matter Movement",
        "credits": "3",
        "description": "(3 crs.) Develop understanding of how and why the Black Lives Matter Movement came into existence, comparing it to the Civil Rights Movement. Defines African American culture today. (Lec. 3)"
    },
    {
        "title": "Talent Development at URI: History, Legacy, Impact",
        "credits": "3",
        "description": "(3 crs.) This course addresses the Talent Development program at URI and the national and local politics that made it possible. Students will also learn about similar programs in the country. (Lec. 3)"
    },
    {
        "title": "Leadership in the African Diaspora",
        "credits": "3",
        "description": "(3 crs.) Critically poses the question: How has leadership informed the African Diaspora and shaped the dynamics of culture with the African Diaspora? (Lec. 3) (A2)"
    },
    {
        "title": "Race and Ethnicity",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (SOC), AAF 240. Relations among the various ethnic, religious, racial, and political minorities and majorities, with special reference to the United States. (Lec. 3) (C3) (A2)"
    },
    {
        "title": "Introduction to Literature of the African Diaspora",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (ENG), AAF 247. Major themes, genres, and motifs of the literatures of Africa and the Americas. Focus on one or more of these regions. Study of black oral and written literatures with emphasis on cultural, historical, political, and socioeconomic contexts.  (Lec. 3, Project 3) (A3) (C3)"
    },
    {
        "title": "African-American Literature from 1900 to the Present",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (ENG), AAF 248. Twentieth-century African-American literature, with emphasis on major issues, movements, and trends, including the study of W.E.B. DuBois, the Harlem Renaissance, the civil rights movement, and the black arts movement. (Lec. 3, Project 3) (A3) (C3)"
    },
    {
        "title": "Special Topics in African and Afro-American Studies",
        "credits": "3",
        "description": "(3 crs.) Selected contemporary topics from the field of African and Afro-American studies. The topical format allows in-depth analysis of some significant aspect of the African and Afro-American experience. Some topics may be offered online. May be repeated with different topic. (Lec. 3/Online) Pre: Completion of AAF 201 or AAF 202, or sophomore standing."
    },
    {
        "title": "Hip Hop, Gender and Sexuality",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (AAF) MUS309, GWS309. Presents students with a variety of issues pertaining to gender and sexuality in aspects of hip-hop music and culture. (Lec. 3) Pre: Sophomore standing, AAF208/MUS208 (C or better), and permission of instructor are required"
    },
    {
        "title": "Black Images in Film",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (AAF), ENG 352. Exploration of the cultural, economic, political, and ideological motivations behind the standard representation of people of the African diaspora in cinema in the U.S. and other areas of the world, while examining film as a genre with a vocabulary and idiom of its own. (Lec. 3, Project 1) (A3) (C3)"
    },
    {
        "title": "Indigenous and African Slavery in the Northeast",
        "credits": "3",
        "description": "(3 crs.) History of the enslavement and bondage of Indigenous and African descended people in New England and Mid-Atlantic states from its origins in the 1640s until the 1840s. (Lec. 3) Pre: AAF 150, or sophomore standing, or by permission of instructor."
    },
    {
        "title": "Black Women in the U.S.: Colonial Times to the Present",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (HIS), AAF 355. Women's experiences in the study of African-American history. Assigned readings familiarize students with the state of scholarship and examine the intersection of race, class, and gender in that experience. (Lec. 3) Pre: sophomore standing. (A3) (C3)"
    },
    {
        "title": "History of Slavery in America",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (HIS), AAF 359. Origins, development, and demise of slavery, with emphasis on the area that currently constitutes the United States. (Lec. 3) Pre: sophomore standing or permission of instructor."
    },
    {
        "title": "Afrofuturism and Black Futures",
        "credits": "3",
        "description": "(3 crs.) What is the future of the African diaspora and what will Blackness be like in the future? Special emphasis on speculative imaginaries, technology, liberation, community, alternative epistemologies, and reparation. (Lec. 3) "
    },
    {
        "title": "African-American Literary Genres",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (ENG), AAF 362. Study of drama and poetry in the continued oral and written heritage of Africa and America, excepting short story and the novel. Focus on Baraka, Bullins, Dunbar, Giovanni, Hughes, and Walker. (Lec. 3, Project 3)"
    },
    {
        "title": "Contemporary African Literature",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (ENG), AAF 364. Study of contemporary African literature by genre, region, or theme, with emphasis on literary traditions, issues, and socio-cultural contexts. (Lec. 3, Project 3)"
    },
    {
        "title": "Twentieth-Century Black Politics and Protest",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (HIS), AAF 366. Explores the development and evolution of black politics and protest in the twentieth century including the Civil Rights and Black Power Movements and their legacies. (Lec. 3) Pre: HIS 150 or AAF 150 or HIS 142 and sophomore standing or permission of instructor. (C3) (B1)"
    },
    {
        "title": "African-Americans and the Legal System",
        "credits": "3",
        "description": "(3 crs.)  Focus on constitutional changes designed to influence the political status of African-Americans in the United States.  (Lec. 3)"
    },
    {
        "title": "Civil Rights Movement",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (AAF), PSC 380.  Major transformations in American life brought about by the civil rights movement in law, in social relations, in the role of government. Focus on the period between 1954 and 1968 in an effort to identify and evaluate the changes in government and civil society that occurred during this period. (Lec. 3)"
    },
    {
        "title": "History of Sub-Saharan Africa",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (HIS), AAF 388. Ancient and medieval Africa, and the impact of Islam; the 'Glorious Age' of the Sudanic empires; the slave trade and the age of exploration; the period of European partition and the rise of African nationalism. (Lec. 3) Pre: sophomore standing or permission of instructor."
    },
    {
        "title": "Directed Study or Research",
        "credits": "3",
        "description": "(3 crs.) Directed study arranged to meet the needs of individual students who desire independent work and to promote collective research efforts in African and Afro-American Studies. (Independent Study) Pre: permission of director."
    },
    {
        "title": "Introduction to Multicultural Psychology",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (PSY), AAF 399.  Introductory course focusing on multiculturalism as a major paradigm.  Emphasizes the meaning of multiculturalism and associated principles, concepts, and sociocultural factors as related to assessment, intervention, and research. (Lec. 3/Online) Pre: PSY 113 or 103."
    },
    {
        "title": "African Governments and Politics",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (PSC), AAF 408. Political developments in the nations of Africa. Main stress is thematic: challenges to democracy, ethnicity, and identity politics, African political thought, civil conflict, resources, and common developmental problems. (Lec. 4, Practicum) Pre: PSC 113 or 210, and PSC 116 or 211."
    },
    {
        "title": "Honors Section of PSC/AAF 408 - African Governments and Politics",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (PSC), AAF 408. Honors Section of PSC/AAF 408 - African Government and Politics. (Lec. 4, Practicum) Pre: PSC 113 or 210, and PSC 116 or 211, and 3.40 or better overall GPA."
    },
    {
        "title": "Issues in African Development",
        "credits": "4",
        "description": "(3 crs.) Cross-listed as (AAF), PSC 410. A seminar focusing on the dynamics of African development, including political and social change, economic development, education, urbanization, rural development, environmental management, labor and business, industrialization, and technology transfer. (Seminar) Pre: APG 313 or PSC 201 or HIS 388 or permission of instructor."
    },
    {
        "title": "Dynamics of Social Change in the Caribbean",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (AAF), PSC, ECN 415. Exploration of the slave trade and the origins of Africans and people of African descent in the Caribbean. Emphasis on political and economic relations with the U.S. and the impact of modernization. (Lec. 3) Not for graduate credit."
    },
    {
        "title": "Institutional Racism",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (SOC), AAF 428. Critically examines the origin, nature, and consequences of institutional racism in the US. (Seminar) Pre: one 300-level sociology course or permission of instructor."
    },
    {
        "title": "Urban Problems",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (PSC), AAF 466. Contemporary and emerging problems of urban affairs. Discussion, reading, and assignments on the interaction among urban change, development of social institutions, and formation of public policy. (Lec. 3/Online) Pre: PSC 113 or 210."
    },
    {
        "title": "Honors Section of AAF/PSC 466: Urban Problems",
        "credits": "3",
        "description": "(3 crs.) Cross-listed as (PSC), AAF 466H. Honors Section of AAF/PSC 466: Urban Problems. (Lec. 3) Pre: PSC 113 or 210, and 3.40 overall GPA."
    },
    {
        "title": "Internship in Africana Studies",
        "credits": {
            "min": "1",
            "max": "6"
        },
        "description": "(1-6 crs.) Supervised professional experience with a relevant agency or organization.  Activities and expectations to be determined between site supervisor and intern and approved by a faculty advisor, prior to registration. May be repeated for up to 12 credits. Not for graduate credit. (Practicum) S/U only."
    },
    {
        "title": "Global Equity, Justice, and Social Media",
        "credits": "4",
        "description": "(4 crs.) Cross-listed as (PSC) AAF 484. Leverage critical lenses to analyze global inequalities and injustices using critical perspectives. The course will explore how systemic biases affect individuals' opportunities across diverse socio-demographic factors worldwide. (Seminar) (C3) (D1)"
    },
    {
        "title": "Senior Seminar in African and Afro-American Studies",
        "credits": "3",
        "description": "(3 crs.) Study of a particular issue of the experience of Blacks in the diaspora from an interdisciplinary perspective. Subject or theme will change yearly. Pre: AAF 150, 201, 202, senior standing, or permission of instructor. Not for graduate credit."
    }
]